{"id":1763,"date":"2023-03-11T06:57:03","date_gmt":"2023-03-11T06:57:03","guid":{"rendered":"https:\/\/croweschools.com.ng\/?p=1763"},"modified":"2023-03-22T06:57:47","modified_gmt":"2023-03-22T06:57:47","slug":"more-on-a-day-director","status":"publish","type":"post","link":"https:\/\/croweschools.com.ng\/news\/more-on-a-day-director\/","title":{"rendered":"More on A-Day Director"},"content":{"rendered":"<div dir=\"auto\"><strong>A DAY DIRECTOR: CROWE SCHOOLS TRAILBLAZING, SETTING THE PACE, RAISING THE BAR.<\/strong><\/div>\n<div dir=\"auto\"><\/div>\n<div dir=\"auto\">&#8220;I got the inspiration from one of the past Governors of Lagos State&#8221; &#8211; <strong>Mr. Alli Adetayo.<\/strong><\/div>\n<div dir=\"auto\"><\/div>\n<div dir=\"auto\">Thursday, the 9th of March 2023, was a great moment and a great event for all who witnessed and participated in the glorification of <strong>Mr Adebiyi Isreal,<\/strong> the pioneer &#8220;One Day Director&#8221; of Crowe International Schools, Iwo.<\/div>\n<div dir=\"auto\"><\/div>\n<div dir=\"auto\">The idea of &#8216;<strong>A Day Director<\/strong>&#8216; having being discussed at one of the school&#8217;s PTA meetings, was to help awaken and discover the &#8220;latent&#8221; leadership quality in student. It was also aimed at creating a positive and constructive competition among the students.   After a thorough screening and assessment process where nine (9) outstanding students were involved, <strong>Adebiyi Isreal<\/strong> emerged the overall winner.<\/div>\n<div dir=\"auto\"><\/div>\n<div dir=\"auto\"><strong>Adebiyi Isreal<\/strong> Adeyemi was born into the family of Engineer Mr &amp; Mrs Adebiyi Adedotun on the 13th, August  2010. He is the first child of four children of this noble family. He has on many occasions emerged as the best student of his class. Isreal also had the best result in the Junior Secondary Schools Certificate Examination (JSSCE), which he wrote in JSS3, 2022. Currently, he is the standing overall best student in SSS1 class being the recipient of the award in 2022.<\/div>\n<div dir=\"auto\"><\/div>\n<div dir=\"auto\"><strong>HOW THE DAY WENT<\/strong><\/div>\n<div dir=\"auto\">The Director decorated was conveyed to school in the early hours of Thursday, the 9th of February, 2023 in company of escorts (a private security outfit) and entourage.<\/div>\n<div dir=\"auto\">The event began with a general assembly for the whole school where the decorated Director (Mr Adebiyi) addressed the entire students of the school.<\/div>\n<div dir=\"auto\"><\/div>\n<div dir=\"auto\">He began his address by greeting the students as peculiar of a Director. He urged the students to emulate him by being committed to their academic work and that they should continue thriving for excellence in all that they do. He also beseeched them to be more discipline and committed to their dreams. He ended his speech by hauling the mantra &#8220;<strong>CROWE SCHOOLS<\/strong>&#8221; while the students in their exuberance reverberated with great echoes &#8220;<strong>LEADING WITH COGNITION<\/strong>&#8220;!!!<\/div>\n<div dir=\"auto\"><\/div>\n<div dir=\"auto\">After the assembly, the One-Day Director in company of his escorts, paid homage to the main Director, <strong>Mr Alli Adetayo<\/strong>, the School Head Of Administration, <strong>Mr Jessy Moses<\/strong>, and other Principal Officers of the School. He, afterwards had a brief meeting with all the members of the staff of the School where he appreciated all their efforts on him and other students of the School. &#8220;May the Good Lord  bless and cause you to reap the good fruit of your labour. I hereby solicit your support and cooperation in order to make this school greater. I love you all and I appreciate you genuinely, I thank you&#8221;, he said. His briefing was received with great joy and pleasantness by all members of the staff. He was then taken to the Director&#8217;s Office where he attended to the press.<\/div>\n<div dir=\"auto\"><\/div>\n<div dir=\"auto\">At the School Hall, the School Scout members under their commandant&#8217;s lead, <strong>Ambassador Olaoluwa<\/strong> ushered the decorated Director in the most spectacular and dignified way. Such that, one would have thought it&#8217;s the Head of  State. As part of the programme, Three (3) Students of the School gave commentaries about the decorated Director. All of them attesting to his excellence spirit. <strong>Akinlabi Na&#8217;eem<\/strong>, a JSS1 student professed &#8220;Senior Isreal is an extraordinary man and also excellent. He relates with me and my colleagues in love and humility not minding the wide gap between us&#8221;. <strong>Aworinde Hephzibah<\/strong>, from JSS3  describes him as &#8220;a radiant shining light and a beacon of excellence&#8221;, while <strong>Ishola Mustapha<\/strong> from SS1 who happens to be the decorated Director’s  bosom friend said in his address that he&#8217;s not surprise with his achievement he described him as a great inspiration to him personally, &#8220;you&#8217;ve broken the record and you&#8217;ll continue to excel more and more&#8221;.<\/div>\n<div dir=\"auto\"><\/div>\n<div dir=\"auto\">In his fatherly address, the Chairman of the PTA Executive Committee, praised the School for such an intelligent initiative. He wasn’t economical in the expression of his joy and satisfaction with the programme.<\/div>\n<div dir=\"auto\">Two members of the staff in persons of <strong>Mr Yusuf Qamorudeen<\/strong>, the School&#8217;s Chief Imam and Chairman of the School press, and <strong>Mr Siraj L<\/strong>., the School&#8217;s Vice Principal gave their commentaries about the One Day Director (Mr Adebiyi Isreal), both stating that it is an honour well meted.<\/div>\n<div dir=\"auto\"><\/div>\n<div dir=\"auto\">The School Director, <strong>Mr Alli Adetayo<\/strong> while giving his powerful speech about the whole event, said he got the inspiration from &#8220;A Day Governor&#8221; initiative of a former Executive Governor of Lagos state and the current President-elect of the Federal Republic of Nigeria, <strong>Asiwaju Bola Ahmed Tinubu<\/strong>. &#8220;We don&#8217;t have the power to make a governor yet, but we can make a One-Day Director&#8221;. He aslo stressed the importance of the initiative which is &#8220;to identify latent leadership talents in students, enablement of a constructive and positive competition as it&#8217;s required in an academic environment and to reconstruct the mindset of the students to seeing the supreme importance of education&#8221;. He solicite the support of the Parents and Students and told them to await more colorful and intellectual programme unfolds.<\/div>\n<div dir=\"auto\"><\/div>\n<div dir=\"auto\">Following this, the One Day Director was called out for his presentation and again, he appreciated the School Director for his efforts and commitments on the School and on him, personally. In appreciation of the staff&#8217;s efforts, he approved the payment of staff transportation allowance, a reasonable and dignified sum. He also stated that his &#8220;leadership promises to be fair and also credible.&#8221;<\/div>\n<div dir=\"auto\"><\/div>\n<div dir=\"auto\">Awards and gifts were presented to him and he was thereafter ushered to his office where he assumed the administrative duties of the day. He served in the capacity of the School Director for 24 hours.<\/div>\n<div dir=\"auto\"><\/div>\n<div dir=\"auto\"><em>A Publication of Crowe International Schools,<\/em><\/div>\n<div dir=\"auto\"><em>Km 3, Iwo-Ejigbo Road, Iwara, Agboowo Area, Iwo, Osun State, Nigeria.<\/em><\/div>\n<ul>\n<li dir=\"auto\">Telephone: +2348067089949, +2347067279632<\/li>\n<li dir=\"auto\">Email: <a href=\"mailto:croweschoolsng@gmail.com\" target=\"_blank\" rel=\"noopener\">croweschoolsng@gmail.com<\/a><\/li>\n<li dir=\"auto\"><a href=\"http:\/\/www.croweschools.com.ng\/\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=http:\/\/www.croweschools.com.ng&amp;source=gmail&amp;ust=1679552779480000&amp;usg=AOvVaw0nkjbNo6QsN-_VkDpGrPWu\">www.croweschools.com.ng<\/a><\/li>\n<li dir=\"auto\">Social Media Handles: @croweschoolsng<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>A DAY DIRECTOR: CROWE SCHOOLS TRAILBLAZING, SETTING THE PACE, RAISING THE BAR. &#8220;I got the inspiration from one of the past Governors of Lagos State&#8221; &#8211; Mr. Alli Adetayo. Thursday, the 9th of March 2023, was a great moment and a great event for all who witnessed and participated in the glorification of Mr Adebiyi Isreal, the pioneer &#8220;One Day Director&#8221; of Crowe International Schools, Iwo. The idea of &#8216;A Day Director&#8216; having being discussed at one of the school&#8217;s PTA meetings, was to help awaken and discover the &#8220;latent&#8221; leadership quality in student. It was also aimed at creating…<\/p>\n","protected":false},"author":1,"featured_media":1764,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"blocksy_meta":{"styles_descriptor":{"styles":{"desktop":"","tablet":"","mobile":""},"google_fonts":[],"version":5}},"_links":{"self":[{"href":"https:\/\/croweschools.com.ng\/wp-json\/wp\/v2\/posts\/1763"}],"collection":[{"href":"https:\/\/croweschools.com.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/croweschools.com.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/croweschools.com.ng\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/croweschools.com.ng\/wp-json\/wp\/v2\/comments?post=1763"}],"version-history":[{"count":1,"href":"https:\/\/croweschools.com.ng\/wp-json\/wp\/v2\/posts\/1763\/revisions"}],"predecessor-version":[{"id":1765,"href":"https:\/\/croweschools.com.ng\/wp-json\/wp\/v2\/posts\/1763\/revisions\/1765"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/croweschools.com.ng\/wp-json\/wp\/v2\/media\/1764"}],"wp:attachment":[{"href":"https:\/\/croweschools.com.ng\/wp-json\/wp\/v2\/media?parent=1763"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/croweschools.com.ng\/wp-json\/wp\/v2\/categories?post=1763"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/croweschools.com.ng\/wp-json\/wp\/v2\/tags?post=1763"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}